0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.5e-5;

boundaryField
{
    inlet
    {
        //type            timeVaryingMappedFixedValue;
        //offset          0;
        //setAverage      off;
        //mapMethod       nearest;
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
	"plane_zone(0|1|2)"
    {
        type            fixedValue;
        value           uniform 0;
    }
    propellerCW
    {
        type            fixedValue;
        value           uniform 0;
    }
	propellerCCW
    {
        type            fixedValue;
        value           uniform 0;
    }
	/*shaft
    {
        type            fixedValue;
        value           uniform 0;
    }*/
	
	domain
	{
		type			overset;
		value			uniform 0;
	}
	domain_PropellerMesh_CCW
	{
		type			overset;
		value			uniform 0;
	}
	domain_PropellerMesh_CCW_PropellerMesh_CW
	{
		type			overset;
		value			uniform 0;
	}
}


// ************************************************************************* //
