system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
	{
        name    base;
        type    cellSet;
        action  new;
        source  regionToCell;
		insidePoints ((0 .5 0));
        set region0;
    }
	
	{
        name    domain1;
        type    cellSet;
        action  new;
        source  regionToCell;
        set region1;
		insidePoints ((0.06 .5 0.12));
    }
	
	{
        name    domain2;
        type    cellSet;
        action  new;
        source  regionToCell;
        set region2;
		insidePoints ((0.06 -.5 0.12));
    }
	
	{
        name    domain1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set region1;
    }
	
	{
        name    domain2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set region2;
    }
);

// ************************************************************************* //
